#!/usr/bin/env python
# -*- coding: utf-8 -*-

import argparse
import logging

log = logging.getLogger(__name__)


class Pupils(object):
    def __init__(self, names=[], letter=None, grade=None):
        self.Names = names
        self.Letter = letter
        self.Grade = grade

    def Iterate(self):
        for name in self.Names:
            yield name


def getPupils(className, addMyself=False, onlyMe=False):
    if className == 'class-2018-10':
        names = [
            u'Гагик Аракелян',
            u'Ирен Аракелян',
            u'Сабина Асадуллаева',
            u'Вероника Битерякова',
            u'Юлия Буянова',
            u'Пелагея Вдовина',
            u'Леонид Викторов',
            u'Фёдор Гнутов',
            u'Илья Гримберг',
            u'Иван Гурьянов',
            u'Артём Денежкин',
            u'Виктор Жилин',
            u'Дмитрий Иванов',
            u'Олег Климов',
            u'Анна Ковалева',
            u'Глеб Ковылин',
            u'Даниил Космынин',
            u'Алина Леоничева',
            u'Ирина Лин',
            u'Олег Мальцев',
            u'Ислам Мунаев',
            u'Александр Наумов',
            u'Георгий Новиков',
            u'Егор Осипов',
            u'Руслан Перепелица',
            u'Михаил Перин',
            u'Егор Подуровский',
            u'Роман Прибылов',
            u'Александр Селехметьев',
            u'Алексей Тихонов',
            u'Алина Филиппова',
            u'Алина Яшина',
        ]
        letter = u'T'
        grade = 10
    elif className == 'class-2018-11':
        names = [
            u'Никита Бекасов',
            u'Ольга Борисова',
            u'Александр Воробьев',
            u'Юлия Глотова',
            u'Александр Гришков',
            u'Валерия Жмурина',
            u'Камиля Измайлова',
            u'Константин Ичанский',
            u'Алексей Карчава',
            u'Данил Колобашкин',
            u'Анастасия Межова',
            u'Роман Мигдисов',
            u'Валерия Никулина',
            u'Даниил Пахомов',
            u'Дарья Рогова',
            u'Валерия Румянцева',
            u'Светлана Румянцева',
            u'Назар Сабинов',
            u'Михаил Тетерин',
            u'Арсланхан Уматалиев',
            u'Дарья Холодная',
        ]
        letter = u'А'
        grade = 11
    elif className == 'class-2018-7':
        names = [
            u'Максим Аксенов',
            u'Елизавета Бовшина',
            u'Даниил Булатов',
            u'Иракли Гиоргидзе',
            u'Артём Глембо',
            u'Наталья Гончарова',
            u'Святослав Григорьев',
            u'Алиса Давыдова',
            u'Василий Еланкин',
            u'Мария Ермишина',
            u'Файёзбек Касымов',
            u'Александр Кирпиченко',
            u'Екатерина Медведева',
            u'Константин Мельник',
            u'Степан Небоваренков',
            u'Матвей Неретин',
            u'Мария Никонова',
            u'Алексей Никул',
            u'Даниил Палаткин',
            u'Илья Стратонников',
            u'Юта Тихонравова',
            u'Арсений Храмов',
            u'Иван Шустов',
            u'Антон Яковлев',
        ]
        letter = u'М'
        grade = 7
    elif className == 'class-2018-8':
        names = [
            u'Ирина Ан',
            u'Софья Андрианова',
            u'Владимир Артемчук',
            u'Софья Белянкина',
            u'Варвара Егиазарян',
            u'Владислав Емелин',
            u'Артём Жичин',
            u'Елизавета Карманова',
            u'Анна Кузьмичёва',
            u'Алёна Куприянова',
            u'Ярослав Лавровский',
            u'Анастасия Ламанова',
            u'Виктория Легонькова',
            u'Семён Мартынов',
            u'Варвара Минаева',
            u'Михаил Неудачин',
            u'Ксения Новикова',
            u'Тимур Перла',
            u'Тимофей Полетаев',
            u'Илья Родионов',
            u'Рената Таржиманова',
            u'Глеб Урбанский',
            u'Андрей Щербаков',
            u'Михаил Ярошевский',
        ]
        letter = u'А1'
        grade = 8
    elif className == 'class-2018-6':
        names = [
            u'Антон Аникеев',
            u'Евдокия Антонова',
            u'Даниил Войнов',
            u'Кристина Демина',
            u'Мария Демина',
            u'Карина Егиазарян',
            u'Вячеслав Есин',
            u'Евгений Камболин',
            u'Даниил Кулиев',
            u'Арсений Митрохин',
            u'Максим Мокроусов',
            u'Дмитрий Николаев',
            u'Мария Потапова',
            u'Олеся Сазонова',
            u'Хадижат Тагирова',
            u'Вячеслав Фёдоров',
            u'Дмитрий Хомяков',
            u'Артем Чекарев',
            u'Ярослав Чернега',
            u'Константин Четкин',
            u'Анастасия Шоколенко',
            u'Степан Шубин',
            u'Андрей Щербаков',
            u'Анна Щербакова',
        ]
        letter = u'Л'
        grade = 6
    else:
        raise RuntimeError('No class config for %r' % className)

    me = [u'Михаил Бурмистров']
    if addMyself:
        names = me + names

    if onlyMe:
        names = me

    log.info('Returning %d pupils from %s-%s', len(names), grade, letter)
    return Pupils(names=names, letter=letter, grade=grade)
