import library.convert
import library.files
import library.location

import os

import logging
log = logging.getLogger(__name__)


class PdfExtractor:
    def __init__(self, source_file=None, destination_directory=None):
        self._source_file = source_file
        if destination_directory:
            self._destination_directory = os.path.join(os.path.dirname(self._source_file), destination_directory)
        else:
            self._destination_directory = os.path.dirname(self._source_file)
        assert os.path.exists(self._source_file), f'No file {self._source_file}'
        assert os.path.isfile(self._source_file), f'Not file {self._source_file}'
        assert os.path.exists(self._destination_directory), f'No dir {self._destination_directory}'
        assert os.path.isdir(self._destination_directory), f'Not dir {self._destination_directory}'

        self._pdf2pdf = library.convert.PdfToPdf(self._source_file)

    def Extract(self, pages, destination_filename):
        dst_file = os.path.join(self._destination_directory, destination_filename)
        if library.files.is_older(self._source_file, dst_file):
            log.debug(f'Skipping updated file \'{destination_filename}\' (no pages check: {pages})')
        else:
            self._pdf2pdf.Extract(pages, dst_file)


def get_convert_config():
    return [
        (library.location.udr('11 класс', 'Вишнякова'), None, False, '.*Вишнякова - [0-9].*'),
        (library.location.udr('11 класс', 'Вишнякова'), None, False, '.*Вишнякова - .* - Все условия.*'),
        (library.location.udr('10 класс'), None, False, '.*Рабочая тетрадь.*'),
        (library.location.udr('9 класс'), None, False, '.*Рабочая тетрадь.*'),
        (
            library.location.ipad('2020-21 Кружок'),
            library.location.udr('12 - кружок - 9-10-11', '2020-21 Кружок и допы - Видео и материалы'),
            True,
            r'.*\b[Кк]ружок.*\.docx$',
        ),
        (
            library.location.udr('12 - кружок - 9-10-11'),
            '2020-21 Кружок и допы - Видео и материалы',
            False,
            r'.*\b[Кк]ружок.*\.docx$',
        ),
        (
            library.location.udr('10 класс', '2020-21 10АБ Физика - Архив'),
            library.location.udr('10 класс', '2020-21 10АБ Физика'),
            False,
            r'.*с урока.*\.docx$',
        ),
        (
            library.location.udr('9 класс', '2020-21 9М Физика - Архив'),
            library.location.udr('9 класс', '2020-21 9М Физика'),
            False,
            r'.*с урока.*\.docx$',
        ),
        (
            library.location.udr('8 класс', '2020-21 Архив'),
            None,
            False,
            r'.*с урока\.docx$',
        ),
    ]


def get_extract_config():
    extract_config = [
        (
            library.location.udr('11 класс', 'Вишнякова', 'Вишнякова - Базовый курс - Все условия.pdf'),
            None,
            {
                '1': 'Вишнякова - 1.1 - Кинематика - БК - условия.pdf',
                '2': 'Вишнякова - 1.2 - Динамика - БК - условия.pdf',
                '3': 'Вишнякова - 1.3 - Статика - БК - условия.pdf',
                '4': 'Вишнякова - 1.4 - Законы сохранения - БК - условия.pdf',
                '5': 'Вишнякова - 1.5 - Колебания и волны - БК - условия.pdf',
                '6': 'Вишнякова - 2.1 - Молекулярная физика - БК - условия.pdf',
                '7': 'Вишнякова - 2.2 - Термодинамика - БК - условия.pdf',
                '8': 'Вишнякова - 3.1 - Электрическое поле - БК - условия.pdf',
                '9': 'Вишнякова - 3.2 - Законы постоянного тока - БК - условия.pdf',
                '10': 'Вишнякова - 3.3 - Магнитное поле - БК - условия.pdf',
                '11': 'Вишнякова - 3.4 - Электромагнитная индукция - БК - условия.pdf',
                '12': 'Вишнякова - 3.5 - Электромагнитные колебания и волны - БК - условия.pdf',
                '13': 'Вишнякова - 3.6 - Оптика - БК - условия.pdf',
                '14': 'Вишнякова - 4 - Основы СТО - БК - условия.pdf',
                '15': 'Вишнякова - 5.1 - Корпускулярно-волновой дуализм - БК - условия.pdf',
                '16': 'Вишнякова - 5.2 - Физика атома - БК - условия.pdf',
                '17': 'Вишнякова - 5.3 - Физика атомного ядра - БК - условия.pdf',
            },
        ),
    ]
    class_config = {
        9: {
            'dst_dir': '2020-21 9М Физика',
            'parts': {
                2: {
                    'name': 'Динамика',
                    'sheets': {
                        '1+1':          ('1.1', 'Материалы-1.1'),
                        '3':            ('1.1', 'З-1'),
                        # '4':            ('1.2', 'Тест-1.2'),
                        '5+1':          ('1.2', 'Материалы-1.2'),
                        '7+1':          ('2.1', 'Материалы-2.1'),
                        # '9':            ('2.1', 'Тест-2.1'),
                        '14+3':         ('2.2', 'Материалы-2.2'),
                        '18+1':         ('2.2', 'ДЗ-2'),
                        '29':           ('3.1', 'Материалы-3.1'),
                        # '32':           ('3.2', 'Тест-3.2'),
                        '31':           ('3.1', 'ДЗ-3'),
                        # '32':           ('3.2', 'Тест-3.2'),
                        # '33':           ('3.3', 'Тест-3.3'),
                        '34+1':         ('3.3', 'Материалы-3.2'),
                        '37+2,41+3':    ('4.2', 'Материалы-4.1'),
                        # '40':           ('4.2', 'Тест-4.2'),
                    },
                },
                3: {
                    'name': 'Законы сохранения',
                    'sheets': {
                        '1+1':      ('1.1', 'Материалы-1.1'),
                        # '3':        ('1.2', 'Тест-1.2'),
                        '4+1,8+1':  ('1.2', 'Материалы-1.2'),
                        '10+1':     ('2.1', 'Материалы-2.1'),
                        '12+5':     ('2.2', 'Материалы-2.2'),
                    },
                },
                4: {
                    'name': 'Колебания и волны',
                    'sheets': {
                        '1+1':  ('1.1', 'Материалы-1.1'),
                        '6+5':  ('1.2', 'Материалы-1.2'),
                        # '12':   ('2.1', 'Тест-2.1'),
                        '13+1': ('2.1', 'Материалы-2.2'),
                        # '15':   ('2.2', 'Тест-2.2'),
                        '16+2': ('2.2', 'Материалы-2.2'),
                        '19+2': ('3.1', 'Материалы-3.1'),
                        '24+4': ('3.2', 'Материалы-3.2'),
                        # '28':   ('3.2', 'Тест-3.3'),
                        '30':   ('3.2', 'ДЗ-3'),
                        # '29':   ('4.1', 'Тест-4.4'),
                        '47,46': ('5.1', 'ДЗ'),
                    },
                },
                5: {
                    'name': 'Магнетизм',
                    'sheets': {
                        '1+3':      ('1.1', 'Материалы-1.1'),
                        '5+4':      ('1.2', 'Материалы-1.2'),
                        '10':       ('2.1', 'Материалы-2.1'),
                        '11+1':     ('2.2', 'Материалы-2.2'),
                        '21+2':     ('4', 'Материалы-4'),
                        '21':       ('4.1', 'Материалы'),
                        '22+1':     ('4.2', 'Материалы'),
                        '24-27':    ('5.1', 'Материалы'),
                        '29-33':    ('5.2', 'Материалы'),
                        '34-35':    ('6.1', 'Материалы'),
                        '36':       ('6.2', 'Материалы'),
                        '37+1':     ('6.2', 'СР'),
                        # '41+2':     ('7.1', 'Материалы'),
                        '41':       ('7.2', 'Материалы-Задание'),
                        '42+1':     ('7.2', 'Материалы-Текст'),
                        '45':       ('8.1', 'Материалы-Задание'),
                        '46+2':     ('8.1', 'Материалы-Текст'),
                        '49+2':     ('9.1', 'Материалы'),
                        '52+1':     ('9.2', 'Текст'),
                        '54+1':     ('9.2', 'Задачи'),
                    },
                },
                6: {
                    'name': 'Строение атома',
                    'sheets': {
                        '1+2':  ('1', 'ДЗ-1'),
                        '1+1':  ('1.1', 'Материалы'),
                        '3':    ('1.2', 'Материалы'),
                        '5+1':  ('2.1', 'Материалы'),
                        '7':    ('2.2', 'Материалы'),
                    },
                },
            },
        },
        10: {
            'dst_dir': '2020-21 10АБ Физика',
            'parts': {
                1: {
                    'name': 'Кинематика',
                    'sheets': {
                        '1+3':          ('1', 'Материалы-1'),
                        '5':            ('1', 'ДЗ-1'),
                        '7':            ('2', 'ДЗ-2'),
                        '9+2':          ('2', 'Материалы-2'),
                        '13':           ('3', 'ДЗ-3'),
                        '14+3, 19':     ('3', 'Материалы-3'),
                        '21+3':         ('4', 'Материалы-4'),
                        '26':           ('4', 'ДЗ-4'),
                        '29':           ('5', 'ДЗ-5'),
                        '30, 32+2':     ('5', 'Материалы-5'),
                    },
                },
                2: {
                    'name': 'Динамика',
                    'sheets': {
                        '1':        ('1', 'ДЗ-1'),
                        '2+3':      ('1.1', 'Материалы-1.1'),
                        # '6':        ('1.2', 'Тест'),
                        '7+3':      ('1.2', 'Материалы-1.2'),
                        '6, 11+6':  ('1.3', 'Материалы-1.3'),

                        '18':       ('2', 'ДЗ-2'),
                        '19+3':     ('2.1', 'Материалы-2.1'),
                        # '23':       ('2.1', 'Тест-2.1'),
                        '24+2':     ('2.2', 'Материалы-2.2'),
                        # '27+1':     ('2.2', 'Тест-2.2'),
                        # '29':       ('2.3', 'Тест-2.3'),
                        '30+2':     ('2.3', 'Материалы-2.3'),

                        '34':       ('3', 'ДЗ-3'),
                        '35+3':     ('3.1', 'Материалы-3.1'),
                        # '39':       ('3.1', 'Тест-3.1'),
                        '40+3':     ('3.2', 'Материалы-3.2'),
                        '44+3':     ('3.3', 'Материалы-3.3'),
                        # '48':       ('3.3', 'Тест-3.3'),
                        '49+1':     ('4.1', 'Материалы-4.1'),
                        '51':       ('4', 'ДЗ-4'),
                    },
                },
                3: {
                    'name': 'Законы сохранения',
                    'sheets': {
                        '1':        ('1', 'ДЗ-1'),
                        '2+6':      ('1.1', 'Материалы-1.1'),
                        '9':        ('1.3', 'Тест-1'),
                        '10+4':     ('1.2', 'Материалы-1.2'),

                        '17':       ('2', 'ДЗ-2'),
                        '18+6':     ('2.1', 'Материалы-2.1'),
                        '25+3':     ('2.2', 'Материалы-2.2'),
                        '29+1':     ('2.3', 'Материалы-2.3'),
                    },
                },
                4: {
                    'name': 'Статика и гидростатика',
                    'sheets': {
                        '1':        ('1', 'ДЗ-1'),
                        '2+5':      ('1.1', 'Материалы-1.1'),
                        '8+3':      ('1.2', 'Материалы-1.2'),
                        '12+3':     ('1.3', 'Материалы-1.3'),
                        '16':       ('1.3', 'Тест-1.3'),

                        '21':       ('2', 'ДЗ-2'),
                        '22+5':     ('2.1', 'Материалы-2.1'),
                        '31':       ('3.1', 'Проверочная-3.1'),
                    },
                },
                5: {
                    'name': 'Повторение механики',
                    'sheets': {

                        '2+4':  ('1.1', 'Материалы-1'),
                        '6+3':  ('1.2', 'Зачет-1'),
                        '10':   ('2', 'Зачет-2'),
                        '11+5': ('3', 'К диагностике'),
                    },
                },
                6: {
                    'name': 'МКТ',
                    'sheets': {
                        '2':                ('1.1', 'Материалы-1'),
                        '3':                ('1', 'ДЗ-1'),
                        '4':                ('1.2', 'Материалы-2'),
                        '6+1':              ('1.3', 'Материалы-3'),
                        '8':                ('1', 'Таблица Менделеева'),
                        '3,8,2,4,6+1':      ('1', 'ДЗ и все материалы'),

                        '11+2':             ('2', 'ДЗ-2'),
                        '9+1':              ('2.1', 'Материалы-1'),
                        '14+1':             ('2.2', 'Материалы-2'),
                        '15':               ('2.3', 'Материалы-3'),
                        '11+2,9+1,14+1':    ('2', 'ДЗ и все материалы'),

                        '21':       ('3', 'ДЗ-3'),
                        '17':       ('3.1', 'Материалы'),
                        '18+1':     ('3.2', 'Материалы'),
                        '20':       ('3.3', 'Материалы'),
                        '21,17+3':  ('3', 'ДЗ и все материалы'),

                        '22':       ('4.1', 'Материалы'),
                        '23':       ('4.2', 'Материалы'),
                        '24':       ('4.3', 'Материалы'),
                        '25+4':     ('5', 'Материалы'),
                    },
                },
                7: {
                    'name': 'Термодинамика',
                    'sheets': {
                        '1-6,8-12,16+3,21+2': ('0', 'Все материалы за все недели'),

                        '1-6':          ('1', 'Неделя 1 - Все материалы'),
                        '1':            ('1', 'ДЗ-1'),
                        '2-4':          ('1.1', 'Материалы'),
                        '5':            ('1.2', 'Материалы'),
                        '6':            ('1.3', 'Материалы'),

                        '8-12':         ('2', 'Неделя 2 - Все материалы'),
                        '8':            ('2', 'ДЗ-2'),
                        '9-10':         ('2.1', 'Материалы'),
                        '11':           ('2.2', 'Материалы'),
                        '12':           ('2.3', 'Материалы'),

                        '16+3,21+2':    ('3', 'Неделя 3 - Все материалы'),
                        '16+3':         ('3.1', 'Материалы'),
                        '21+1':         ('3.2', 'Материалы'),
                        '23':           ('3.3', 'Материалы'),
                    },
                },
                8: {
                    'name': 'Электростатика',
                    'sheets': {
                        '1+6':          ('1', 'Неделя 1 - Все материалы'),
                        '1':            ('1', 'ДЗ-1'),
                        '2+2':          ('1.1', 'Материалы'),
                        '5+2':          ('1.2', 'Материалы'),

                        '13,8+4,14':    ('2', 'Неделя 2 - Все материалы'),
                        '8+1':          ('2.1', 'Материалы'),
                        '10+2':         ('2.2', 'Материалы'),
                        '13':           ('2', 'ДЗ-2'),
                        '14':           ('2.3', 'Материалы'),

                        '17,18+1,21+1,23+1':        ('3', 'Неделя 3 - Все материалы'),
                        '17':                       ('3', 'ДЗ-3'),
                        '18+1':                     ('3', 'Бонус-трэк'),
                        '21+1':                     ('3.1', 'Материалы'),
                        '23+1':                     ('3.2', 'Материалы'),
                        '25+1':                     ('3.3', 'Материалы'),
                    },
                },
                9: {
                    'name': 'Постоянный ток',
                    'sheets': {
                        '1-5':      ('1', 'Неделя 1 - Все материалы'),
                        '1':        ('1', 'ДЗ-1'),
                        '2+1':      ('1.1', 'Материалы'),
                        # '4':        ('1.2', 'Материалы'),
                        '4+1':      ('1.3', 'Материалы'),
                    },
                },
            },
        },
    }
    for grade, grade_config in class_config.items():
        dst_dir = grade_config['dst_dir']
        for part, part_config in grade_config['parts'].items():
            part_name = part_config['name']
            prefix = f'{grade}-{part} - {part_name}'
            extract_config.append((
                library.location.udr(f'{grade} класс', f'{prefix} - Рабочая тетрадь.pdf'),
                library.location.udr(f'{grade} класс', f'{dst_dir}', prefix),
                {
                    pages: f'{grade}-{part}-{index} - {part_name} - {file_name}.pdf'
                    for pages, (index, file_name) in part_config['sheets'].items()
                },
            ))

    return extract_config


def run(args):
    docxToPdf = library.convert.DocxToPdf()
    for src_dir, dst_dir, recursive, regexp in get_convert_config():
        docxToPdf.ConvertDir(
            src_dir,
            destination_directory=dst_dir,
            recursive=recursive,
            regexp=regexp,
        )

    for source_file, destination_directory, config in get_extract_config():
        pdfExtractor = PdfExtractor(
            source_file=source_file,
            destination_directory=destination_directory,
        )
        for pages, filename in config.items():
            pdfExtractor.Extract(pages, filename)


def populate_parser(parser):
    parser.set_defaults(func=run)
