import library.convert
import library.files
import library.location

import os

import logging
log = logging.getLogger(__name__)


class PdfExtractor:
    def __init__(self, source_file=None, destination_directory=None):
        self._source_file = source_file
        if destination_directory:
            self._destination_directory = os.path.join(os.path.dirname(self._source_file), destination_directory)
        else:
            self._destination_directory = os.path.dirname(self._source_file)
        assert os.path.exists(self._source_file), f'No file {self._source_file}'
        assert os.path.isfile(self._source_file), f'Not file {self._source_file}'
        assert os.path.exists(self._destination_directory), f'No dir {self._destination_directory}'
        assert os.path.isdir(self._destination_directory), f'Not dir {self._destination_directory}'

        self._pdf2pdf = library.convert.PdfToPdf(self._source_file)

    def Extract(self, pages, destination_filename):
        dst_file = os.path.join(self._destination_directory, destination_filename)
        if library.files.is_older(self._source_file, dst_file):
            log.debug(f'Skipping updated file \'{destination_filename}\' (no pages check: {pages})')
        else:
            self._pdf2pdf.Extract(pages, dst_file)


def get_convert_config():
    return [
        (library.location.udr('11 класс', 'Вишнякова'), None, False, '.*Вишнякова - [0-9].*'),
        (library.location.udr('11 класс', 'Вишнякова'), None, False, '.*Вишнякова - .* - Все условия.*'),
        (library.location.udr('10 класс'), None, False, '.*Рабочая тетрадь.*'),
        (library.location.udr('9 класс'), None, False, '.*Рабочая тетрадь.*'),
        (
            library.location.ipad('2020-21 Кружок'),
            library.location.udr('12 - кружок - 9-10-11', '2020-21 Кружок и допы - Видео и материалы'),
            True,
            r'.*\b[Кк]ружок\.docx$',
        ),
        (
            library.location.udr('12 - кружок - 9-10-11'),
            '2020-21 Кружок и допы - Видео и материалы',
            False,
            r'.*\b[Кк]ружок\.docx$',
        ),
        (
            library.location.udr('10 класс', '2020-21 10АБ Физика - Архив'),
            library.location.udr('10 класс', '2020-21 10АБ Физика'),
            False,
            r'.*с урока.*\.docx$',
        ),
        (
            library.location.udr('9 класс', '2020-21 9М Физика - Архив'),
            library.location.udr('9 класс', '2020-21 9М Физика'),
            False,
            r'.*с урока.*\.docx$',
        ),
        (
            library.location.udr('8 класс', '2020-21 Архив'),
            None,
            False,
            r'.*с урока\.docx$',
        ),
    ]


def get_extract_config():
    return [
        (
            library.location.udr('11 класс', 'Вишнякова', 'Вишнякова - Базовый курс - Все условия.pdf'),
            None,
            {
                '1': 'Вишнякова - 1.1 - Кинематика - БК - условия.pdf',
                '2': 'Вишнякова - 1.2 - Динамика - БК - условия.pdf',
                '3': 'Вишнякова - 1.3 - Статика - БК - условия.pdf',
                '4': 'Вишнякова - 1.4 - Законы сохранения - БК - условия.pdf',
                '5': 'Вишнякова - 1.5 - Колебания и волны - БК - условия.pdf',
                '6': 'Вишнякова - 2.1 - Молекулярная физика - БК - условия.pdf',
                '7': 'Вишнякова - 2.2 - Термодинамика - БК - условия.pdf',
                '8': 'Вишнякова - 3.1 - Электрическое поле - БК - условия.pdf',
                '9': 'Вишнякова - 3.2 - Законы постоянного тока - БК - условия.pdf',
                '10': 'Вишнякова - 3.3 - Магнитное поле - БК - условия.pdf',
                '11': 'Вишнякова - 3.4 - Электромагнитная индукция - БК - условия.pdf',
                '12': 'Вишнякова - 3.5 - Электромагнитные колебания и волны - БК - условия.pdf',
                '13': 'Вишнякова - 3.6 - Оптика - БК - условия.pdf',
                '14': 'Вишнякова - 4 - Основы СТО - БК - условия.pdf',
                '15': 'Вишнякова - 5.1 - Корпускулярно-волновой дуализм - БК - условия.pdf',
                '16': 'Вишнякова - 5.2 - Физика атома - БК - условия.pdf',
                '17': 'Вишнякова - 5.3 - Физика атомного ядра - БК - условия.pdf',
            },
        ),
        (
            library.location.udr('10 класс', '10-1 - Кинематика - Рабочая тетрадь.pdf'),
            library.location.udr('10 класс', '2020-21 10АБ Физика', '10-1 Кинематика'),
            {
                '1+3':         '10-1-1 - Кинематика - Материалы-1.pdf',
                '5':           '10-1-1 - Кинематика - ДЗ-1.pdf',
                '7':           '10-1-2 - Кинематика - ДЗ-2.pdf',
                '9+2':         '10-1-2 - Кинематика - Материалы-2.pdf',
                '13':          '10-1-3 - Кинематика - ДЗ-3.pdf',
                '14+3, 19':    '10-1-3 - Кинематика - Материалы-3.pdf',
                '21+3':        '10-1-4 - Кинематика - Материалы-4.pdf',
                '26':          '10-1-4 - Кинематика - ДЗ-4.pdf',
                '29':          '10-1-5 - Кинематика - ДЗ-5.pdf',
                '30, 32+2':    '10-1-5 - Кинематика - Материалы-5.pdf',
            },
        ),
        (
            library.location.udr('10 класс', '10-1 - Кинематика - Рабочая тетрадь.pdf'),
            library.location.udr('10 класс', '2020-21 10АБ Физика', '10-5 Повторение механики'),
            {

                '2+4':        '10-5-1.1 - Повторение механики - Материалы-1.pdf',
                '6+3':        '10-5-1.2 - Повторение механики - Зачет-1.pdf',
            },
        ),
        (
            library.location.udr('10 класс', '10-2 - Динамика - Рабочая тетрадь.pdf'),
            library.location.udr('10 класс', '2020-21 10АБ Физика', '10-2 Динамика'),
            {
                '1':        '10-2-1 - Динамика - ДЗ-1.pdf',
                '2+3':      '10-2-1.1 - Динамика - Материалы-1.1.pdf',
                # '6':        '10-2-1.2 - Динамика - Тест.pdf',
                '7+3':      '10-2-1.2 - Динамика - Материалы-1.2.pdf',
                '6, 11+6':  '10-2-1.3 - Динамика - Материалы-1.3.pdf',
                '18':       '10-2-2 - Динамика - ДЗ-2.pdf',
                '19+3':     '10-2-2.1 - Динамика - Материалы-2.1.pdf',
                '23':       '10-2-2.1 - Динамика - Тест-2.1.pdf',
                '24+2':     '10-2-2.2 - Динамика - Материалы-2.2.pdf',
                '27+1':     '10-2-2.2 - Динамика - Тест-2.2.pdf',
                '29':       '10-2-2.3 - Динамика - Тест-2.3.pdf',
                '30+2':     '10-2-2.3 - Динамика - Материалы-2.3.pdf',
                '34':       '10-2-3 - Динамика - ДЗ-3.pdf',
                '35+3':     '10-2-3.1 - Динамика - Материалы-3.1.pdf',
                '39':       '10-2-3.1 - Динамика - Тест-3.1.pdf',
                '40+3':     '10-2-3.2 - Динамика - Материалы-3.2.pdf',
                '44+3':     '10-2-3.3 - Динамика - Материалы-3.3.pdf',
                '48':       '10-2-3.3 - Динамика - Тест-3.3.pdf',
                '49+1':     '10-2-4.1 - Динамика - Материалы-4.1.pdf',
                '51':       '10-2-4 - Динамика - ДЗ-4.pdf',
            },
        ),
        (
            library.location.udr('10 класс', '10-3 - Законы сохранения - Рабочая тетрадь.pdf'),
            library.location.udr('10 класс', '2020-21 10АБ Физика', '10-3 Законы сохранения'),
            {
                '1':        '10-3-1 - Законы сохранения - ДЗ-1.pdf',
                '2+6':      '10-3-1.1 - Законы сохранения - Материалы-1.1.pdf',
                '9':        '10-3-1.3 - Законы сохранения - Тест-1.pdf',
                '10+4':      '10-3-1.2 - Законы сохранения - Материалы-1.2.pdf',
                '17':        '10-3-2 - Законы сохранения - ДЗ-2.pdf',
                '18+6':      '10-3-2.1 - Законы сохранения - Материалы-2.1.pdf',
                '25+3':      '10-3-2.2 - Законы сохранения - Материалы-2.2.pdf',
                '29+1':      '10-3-2.3 - Законы сохранения - Материалы-2.3.pdf',
            },
        ),
        (
            library.location.udr('10 класс', '10-4 - Статика и гидростатика - Рабочая тетрадь.pdf'),
            library.location.udr('10 класс', '2020-21 10АБ Физика', '10-4 Статика и гидростатика'),
            {
                '1':        '10-4-1 - Статика и гидростатика - ДЗ-1.pdf',
                '2+5':      '10-4-1.1 - Статика и гидростатика - Материалы-1.1.pdf',
                '8+3':      '10-4-1.2 - Статика и гидростатика - Материалы-1.2.pdf',
                '12+3':     '10-4-1.3 - Статика и гидростатика - Материалы-1.3.pdf',
                '16':       '10-4-1.3 - Статика и гидростатика - Тест-1.3.pdf',
                '21':       '10-4-2 - Статика и гидростатика - ДЗ-2.pdf',
                '22+5':     '10-4-2.1 - Статика и гидростатика - Материалы-2.1.pdf',
                '31':       '10-4-3.1 - Статика и гидростатика - Проверочная-3.1.pdf',
            },
        ),
        (
            library.location.udr('10 класс', '10-6 - МКТ - Рабочая тетрадь.pdf'),
            library.location.udr('10 класс', '2020-21 10АБ Физика', '10-6 МКТ'),
            {
                # '2':    '10-6-1.1 - МКТ - Материалы-1.pdf',
                '3':    '10-6-1 - МКТ - ДЗ-1.pdf',
                # '4':    '10-6-1.2 - МКТ - Материалы-2.pdf',
                # '6+1':  '10-6-1.3 - МКТ - Материалы-3.pdf',
                # '8':    '10-6-1 - МКТ - Таблица Менделеева.pdf',
                '3,8,2,4,6+1':    '10-6-1 - МКТ - ДЗ и все материалы.pdf',
                '11+2':   '10-6-2 - МКТ - ДЗ-2.pdf',
                '9+1':  '10-6-2.1 - МКТ - Материалы-1.pdf',
                '14+1': '10-6-2.2 - МКТ - Материалы-2.pdf',
                '15':   '10-6-2.3 - МКТ - Материалы-3.pdf',
                '11+2,9+1,14+1': '10-6-2 - МКТ - ДЗ и все материалы.pdf',
                '21':   '10-6-3 - МКТ - ДЗ-3.pdf',
                '17':   '10-6-3.1 - МКТ - Материалы.pdf',
                '18+1': '10-6-3.2 - МКТ - Материалы.pdf',
                '20':   '10-6-3.3 - МКТ - Материалы.pdf',
            },
        ),
        (
            library.location.udr('9 класс', '9-2 - Динамика - Рабочая тетрадь.pdf'),
            library.location.udr('9 класс', '2020-21 9М Физика', '9-2 - Динамика'),
            {
                '1+1':  '9-2-1.1 - Динамика - Материалы-1.1.pdf',
                '3':    '9-2-1.1 - Динамика - З-1.pdf',
                # '4':    '9-2-1.2 - Динамика - Тест-1.2.pdf',
                '5+1':  '9-2-1.2 - Динамика - Материалы-1.2.pdf',
                '7+1':  '9-2-2.1 - Динамика - Материалы-2.1.pdf',
                # '9':    '9-2-2.1 - Динамика - Тест-2.1.pdf',
                '14+3': '9-2-2.2 - Динамика - Материалы-2.2.pdf',
                '18+1': '9-2-2.2 - Динамика - ДЗ-2.pdf',
                '29':   '9-2-3.1 - Динамика - Материалы-3.1.pdf',
                # '32':   '9-2-3.2 - Динамика - Тест-3.2.pdf',
                '31':   '9-2-3.1 - Динамика - ДЗ-3.pdf',
                # '32':   '9-2-3.2 - Динамика - Тест-3.2.pdf',
                # '33':   '9-2-3.3 - Динамика - Тест-3.3.pdf',
                '34+1': '9-2-3.3 - Динамика - Материалы-3.2.pdf',
                '37+2,41+3': '9-2-4.2 - Динамика - Материалы-4.1.pdf',
                # '40':   '9-2-4.2 - Динамика - Тест-4.2.pdf',
            },
        ),
        (
            library.location.udr('9 класс', '9-3 - Законы сохранения - Рабочая тетрадь.pdf'),
            library.location.udr('9 класс', '2020-21 9М Физика', '9-3 - Законы сохранения'),
            {
                '1+1': '9-3-1.1 - Законы сохранения - Материалы-1.1.pdf',
                # '3':   '9-3-1.2 - Законы сохранения - Тест-1.2.pdf',
                '4+1,8+1': '9-3-1.2 - Законы сохранения - Материалы-1.2.pdf',
                '10+1': '9-3-2.1 - Законы сохранения - Материалы-2.1.pdf',
                '12+5': '9-3-2.2 - Законы сохранения - Материалы-2.2.pdf',
            },
        ),
        (
            library.location.udr('9 класс', '9-4 - Колебания и волны - Рабочая тетрадь.pdf'),
            library.location.udr('9 класс', '2020-21 9М Физика', '9-4 - Колебания и волны'),
            {
                '1+1': '9-4-1.1 - Колебания и волны - Материалы-1.1.pdf',
                '6+5': '9-4-1.2 - Колебания и волны - Материалы-1.2.pdf',
                # '12': '9-4-2.1 - Колебания и волны - Тест-2.1.pdf',
                '13+1': '9-4-2.1 - Колебания и волны - Материалы-2.2.pdf',
                # '15': '9-4-2.2 - Колебания и волны - Тест-2.2.pdf',
                '16+2': '9-4-2.2 - Колебания и волны - Материалы-2.2.pdf',
                '19+2': '9-4-3.1 - Колебания и волны - Материалы-3.1.pdf',
                '24+4': '9-4-3.2 - Колебания и волны - Материалы-3.2.pdf',
                # '28': '9-4-3.2 - Колебания и волны - Тест-3.3.pdf',
                '30': '9-4-3.2 - Колебания и волны - ДЗ-3.pdf',
                # '29': '9-4-4.1 - Колебания и волны - Тест-4.4.pdf',
                '47,46': '9-4-5.1 - Колебания и волны - ДЗ.pdf',
            },
        ),
        (
            library.location.udr('9 класс', '9-5 - Магнетизм - Рабочая тетрадь.pdf'),
            library.location.udr('9 класс', '2020-21 9М Физика', '9-5 - Магнетизм'),
            {
                '1+3': '9-5-1.1 - Магнетизм - Материалы-1.1.pdf',
                '5+4': '9-5-1.2 - Магнетизм - Материалы-1.2.pdf',
                '10': '9-5-2.1 - Магнетизм - Материалы-2.1.pdf',
            },
        ),
    ]


def run(args):
    docxToPdf = library.convert.DocxToPdf()
    for src_dir, dst_dir, recursive, regexp in get_convert_config():
        docxToPdf.ConvertDir(
            src_dir,
            destination_directory=dst_dir,
            recursive=recursive,
            regexp=regexp,
        )

    for source_file, destination_directory, config in get_extract_config():
        pdfExtractor = PdfExtractor(
            source_file=source_file,
            destination_directory=destination_directory,
        )
        for pages, filename in config.items():
            pdfExtractor.Extract(pages, filename)


def populate_parser(parser):
    parser.set_defaults(func=run)
